import spacy


# nlp = spacy.load('el')
nlp = spacy.load('custom_model')

specific_text = "Εμπόριο βρεφών στη Θεσσαλονίκη: Ποιους φακέλους ξεσκονίζει η ΕΛ.ΑΣ. Έρευνα για υποθέσεις που " \
                "σχετίζονται με εμπόριο βρεφών ξεκίνησε η Ασφάλεια Θεσσαλονίκης, ύστερα από την παραγγελία " \
                "προκαταρκτικής εξέτασης από την Εισαγγελία Πρωτοδικών Θεσσαλονίκης, με φόντο τις σοβαρές καταγγελίες " \
                "γυναικών από την Αλβανία για κυκλώματα με έδρα την Ελλάδα. Όλα ξεκίνησαν από μία διπλή δολοφονία στα " \
                "Τίρανα. Εκεί την παραμονή της Πρωτοχρονιάς ένας 59χρονος εκτέλεσε δύο αδερφές, με τις οποίες είχε " \
                "στο παρελθόν ερωτική σχέση. Οι συγγενείς των θυμάτων κατήγγειλαν μετά το έγκλημα στις αλβανικές " \
                "Αρχές ότι ο δράστης εξέδιδε τα δύο θύματα στη Θεσσαλονίκη, τα ανάγκαζε σε κυοφορία και ακολούθως " \
                "πουλούσε τα βρέφη σε άτεκνα ζευγάρια, με τη βοήθεια Έλληνα δικηγόρου από τη βόρεια Ελλάδα.Η Ασφάλεια " \
                "Θεσσαλονίκης έχει ζητήσει μέσω Ιντερπόλ από τις αλβανικές Αρχές το φάκελο με τις σοβαρές καταγγελίες " \
                "για αγοραπωλησίες βρεφών. Από τη μέχρι στιγμής έρευνα προκύπτει ότι τα δύο θύματα είχαν συλληφθεί το " \
                "1992 και το 2003 σε Θεσσαλονίκη και Αθήνα για το νόμο περί αλλοδαπών και εκδιδόμενων προσώπων. Οι " \
                "δύο γυναίκες που δολοφονήθηκαν προσπαθούσαν να ξεφύγουν από τον 59χρονο, ο οποίος τις απειλούσε και " \
                "τις ζήλευε. Η Ελληνική Αστυνομία θα προχωρήσει από εδώ και πέρα στις παρακάτω ενέργειες: Αρχικά θα " \
                "διασταυρώσει εάν με τα ονόματα των δύο αδελφών που δολοφονήθηκαν είχαν γίνει νομιμοφανείς υιοθεσίες " \
                "στη χώρα μας. Αστυνομικές πηγές εξηγούν ότι σε πολλές περιπτώσεις οι διαδικασίες υιοθεσιών φαίνονται " \
                "απολύτως νόμιμες, χωρίς κανείς να γνωρίζει ότι πίσω από αυτές κρύβονται βιασμοί, αναγκαστικές " \
                "κυοφορίες και θύματα μαστροπείας. Τα κυκλώματα εκμεταλλεύονται ευάλωτες γυναίκες, οι οποίες δεν " \
                "προσφεύγουν στις Αρχές. Όπως δηλαδή ακριβώς έγινε και με την περίπτωση των δύο αδελφών από τα " \
                "Τίρανα. Η αλβανική Αστυνομία ενημερώθηκε για τη δράση του 59χρονου αφού είχε γίνει πρώτα το κακό. Οι " \
                "αστυνομικοί θα διασταυρώσουν λοιπόν εάν έγιναν υιοθεσίες, στις οποίες να εμφανίζονται ως μητέρες τα " \
                "δύο θύματα, ενώ ιδιαίτερη προσοχή θα δοθεί σε περιπτώσεις στις οποίες μπορεί να χρησιμοποιήθηκαν " \
                "πλαστά έγγραφα. Το δεύτερο αντικείμενο της έρευνας της ΕΛ.ΑΣ. είναι η έρευνα για τη δράση του " \
                "δικηγόρου. Οι αστυνομικοί θα πάρουν στα χέρια τους το όνομα του Έλληνα δικηγόρου που φέρεται (όπως " \
                "προκύπτει από τις καταγγελίες των συγγενών των θυμάτων) να μεσολαβούσε για τον εντοπισμό αγοραστών " \
                "για τα βρέφη. Το όνομα του δικηγόρου (είτε αυτός βρίσκεται εν ζωή είτε όχι) θα ξεκλειδώσει τις " \
                "έρευνες. Στο παρελθόν η Ασφάλεια Θεσσαλονίκης έχει χειριστεί ξανά υποθέσεις με αγοραπωλησίες βρεφών. " \
                "Στις υποθέσεις αυτές είχαν εμπλοκή δικηγόροι, ενώ τα κυκλώματα είχαν «πλοκάμια» στη γειτονική " \
                "Βουλγαρία. Οι γέννες γίνονταν σε μαιευτήρια στη χώρα μας, οι μητέρες κρατούσαν για λίγες ημέρες τα " \
                "νεογνά και κατόπιν τα παρέδιδαν στους αγοραστές που πλήρωναν αδρά.Οι εγκληματικές οργανώσεις " \
                "εκμεταλλεύονταν την ανάγκη άτεκνων ζευγαριών να υιοθετήσουν ένα παιδί αλλά και τις αυστηρές " \
                "προϋποθέσεις που έθετε ο νόμος για τη διαδικασία. Σημειώνεται ότι η παρέμβαση της Εισαγγελίας " \
                "Πρωτοδικών Θεσσαλονίκης έγινε κατόπιν δημοσιευμάτων με καταγγελίες συγγενών των θυμάτων σε αλβανικά " \
                "μέσα ενημέρωσης, σύμφωνα με τις οποίες ο δράστης, που συνελήφθη και κρατείται, εξέδιδε τις δύο " \
                "αδελφές, τις υποχρέωνε να τεκνοποιούν και στη συνέχεια να πουλούν τα βρέφη τους στην χώρα μας. Όπως " \
                "έγινε γνωστό, ο προϊστάμενος της Εισαγγελίας Πρωτοδικών Θεσσαλονίκης, Παναγιώτης Παναγιωτόπουλος, " \
                "παρήγγειλε την έρευνα στην Ασφάλεια Θεσσαλονίκης, ώστε να διαλευκανθούν οι καταγγελίες περί " \
                "παράνομων υιοθεσιών κι αν υπάρχει εμπλοκή οργανωμένου κυκλώματος. Κατά τις ίδιες καταγγελίες, " \
                "πάνω από δέκα παιδιά γεννήθηκαν σε ελληνικά μαιευτήρια και πωλήθηκαν έναντι αμοιβής με τη βοήθεια " \
                "δικηγόρου που δεν βρίσκεται εν ζωή.Το διπλό φονικό αποκαλύφθηκε την παραμονή της Πρωτοχρονιάς στα " \
                "Τίρανα, όπου οι άτυχες γυναίκες έπεσαν νεκρές από πυρά του 59χρονου, ο οποίος συνελήφθη και " \
                "απολογούμενος προανακριτικά ισχυρίστηκε ότι το κίνητρο της αποτρόπαιης πράξης ήταν η τυφλή ζήλια. "

specific_text2 = "Η ομάδα δακτυλοσκόπησης της Διεύθυνσης Εγκληματολογικών Ερευνών της Αστυνομίας και ο διοικητής του " \
                 "Τμήματος Ασφαλείας Ομόνοιας ήταν οι πρωταγωνιστές στη διαδικασία ταυτοποίησης της 38χρονης Κινέζας, " \
                 "η οποία βρέθηκε δολοφονημένη μέσα σε βαλίτσα στα Βίλια. Ο διοικητής του Τμήματος Ασφαλείας της " \
                 "Ομόνοιας ήταν ο άνθρωπος που από την πρώτη στιγμή που βρέθηκε η βαλίτσα στα Βίλια κατάλαβε ότι το " \
                 "θύμα είναι η εξαφανισμένη Κινέζα. Αμέσως ενημέρωσε το Τμήμα Ανθρωποκτονιών της ΕΛ.ΑΣ. για το " \
                 "«ένστικτό» του. Ο αξιωματικός αυτός είχε ασχοληθεί με την εξαφάνιση της 38χρονης από τις 17 " \
                 "Οκτωβρίου 2020, όταν δύο ομοεθνείς της είχαν δηλώσει την εξαφάνιση στο Τ.Α. Ομόνοιας. Τα " \
                 "χαρακτηριστικά του πτώματος στα Βίλια ταίριαζαν στις περιγραφές που είχαν δοθεί για την 38χρονη, " \
                 "για την οποία υπήρχαν από την πρώτη στιγμή υποψίες ότι έπεσε θύμα εγκληματικής ενέργειας.Χάρη στον " \
                 "συγκεκριμένο αξιωματικό του Τ.Α Ομόνοιας οι άντρες του Τμήματος Ανθρωποκτονιών είχαν επικεντρωθεί " \
                 "στην περίπτωση της 38χρονης, πριν την ταυτοποίησή της.Τη σκυτάλη των ερευνών πήρε στη συνέχεια η " \
                 "ομάδα δακτυλοσκόπησης της Διεύθυνσης Εγκληματολογικών Ερευνών που κατάφερε να ταυτοποιήσει το πτώμα " \
                 "από τα δακτυλικά αποτυπώματα. Αστυνομικές πηγές εξηγούν ότι πρόκειται για μία δύσκολη διαδικασία " \
                 "που απαιτεί ειδικές τεχνικές, καθώς το πτώμα βρέθηκε σε προχωρημένη σήψη.Με τις ειδικές τεχνικές οι " \
                 "επιστήμονες της ΕΛ.ΑΣ. κατάφεραν την ταυτοποίηση μέσα σε μόλις 48 ώρες. Η έρευνα συνεχίζεται πλέον " \
                 "από το Τμήμα Ανθρωποκτονιών για τη σύλληψη του δράστη ή των δραστών. Οι αστυνομικοί έχουν στα χέρια " \
                 "τους το φάκελο από το Τ.Α. Ομόνοιας και αναμένεται να ανοίξουν τον κύκλο καταθέσεων.Το Χαμόγελο του " \
                 "Παιδιού είχε εκδώσει στις 24 Οκτωβρίου 2020 «Missing Alert» για την 38χρονη, Lin Qiu Yun, " \
                 "η οποία εξαφανίστηκε από το κέντρο της Αθήνας, κάτω από μυστηριώδεις συνθήκες.Η εξαφάνισή της " \
                 "δηλώθηκε λίγες ημέρες νωρίτερα, στις 17 Οκτωβρίου, στο Τμήμα Ασφαλείας της Ομόνοιας. Η 38χρονη " \
                 "Κινέζα εξαφανίστηκε από την περιοχή του Μεταξουργείου.Το «Χαμόγελο του Παιδιού» ενημερώθηκε για την " \
                 "εξαφάνιση της και προχώρησε στη δημοσιοποίηση των στοιχείων της 38χρονης, κατόπιν αιτήματος των " \
                 "συγγενών της. Η ανάρτηση ανέφερε μάλιστα τότε ότι μπορεί να συντρέχουν λόγοι, οποίοι θέτουν τη ζωή " \
                 "της σε κίνδυνο.Η Lin Qiu Yun είχε ύψος 1.55μ., κανονικό βάρος, καστανά μαλλιά και μαύρα μάτια. Την " \
                 "ημέρα που εξαφανίστηκε φορούσε μαύρα παπούτσια, τζιν παντελόνι, μαύρο μπουφάν και καφέ τσάντα. Παρά " \
                 "τις έρευνες, ωστόσο, η άτυχη γυναίκα δεν είχε εντοπιστεί τον Οκτώβριο.Όπως διαπιστώθηκε την " \
                 "παραμονή της Πρωτοχρονιάς, τα δακτυλικά της αποτυπώματα ταυτοποιούνται μετά του πτώματος που " \
                 "βρέθηκε μέσα σε βαλίτσα στα Βίλια.Φαίνεται ότι κάποιος ή κάποιοι δολοφόνησαν την άτυχη γυναίκα σε " \
                 "χρόνο που δεν προσδιορίζεται. Οι αστυνομικοί δεν αποκλείουν η δολοφονία να έγινε αρκετό καιρό μετά " \
                 "την εξαφάνιση της 38χρονης γυναίκας. Το ερώτημα είναι μέχρι τότε που κρατούσαν οι δράστες την " \
                 "υπήκοο Κίνας και για ποιο λόγο τη δολοφόνησαν.Οι αστυνομικοί θα πάρουν κατάθεση από τον άνθρωπο που " \
                 "είχε δηλώσει την εξαφάνιση της 38χρονης, ενώ θα κάνουν έρευνα στο σπίτι όπου ζούσε στο κέντρο της " \
                 "Αθήνας.Το θύμα πιθανότατα δολοφονήθηκε διά ασφυξίας. Ο δράστης δηλαδή της έκλεισε με τη βία τις " \
                 "αναπνευστικές οδούς, μέχρι που η άτυχη γυναίκα άφησε την τελευταία της πνοή.Σύμφωνα με την " \
                 "πιθανότερη εκδοχή, ακολούθως οι δράστες έβαλαν αμέσως το πτώμα σε βαλίτσα, το οποίο εγκατέλειψαν σε " \
                 "δύσβατη περιοχή στα Βίλια. Η βαλίτσα έμεινε στο σημείο, σύμφωνα με την εκτίμηση, από πέντε έως 30 " \
                 "ημέρες. Ο ιατροδικαστής δεν εντόπισε κακώσεις, ενώ το πτώμα ήταν σε προχωρημένη σήψη με αποτέλεσμα " \
                 "να μη μπορεί να προσδιοριστεί η αιτία θανάτου.Από τις τοξικολογικές εξετάσεις αναμένεται να " \
                 "διαπιστωθεί εάν η κοπέλα είχε πάρει οποιαδήποτε ουσία ή και εάν της είχαν χορηγηθεί βίαια.Από την " \
                 "πρώτη στιγμή, οι αξιωματικοί του ανθρωποκτονιών είχαν επικεντρώσει την έρευνά τους σε γυναίκες " \
                 "ηλικίας 30 έως 40 ετών, που είχε δηλωθεί η εξαφάνισή τους και αναζητούνταν από τους οικείους τους. "

# test the saved model
nlp2 = spacy.load('custom_model/')
doc = nlp(specific_text)

print(spacy.displacy.serve(doc, style='ent'))


